{
    "name": "Michał Pawlukiewicz",
    "logo_name": "michal-pawlukiewicz",
    "role": "Back-end Developer",
    "about": {
        "sections": {
            "professional-info": {
                "title": "professional-info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "experience",
                        "description": "<br>02.2024–03.2025: <br>Junior Software Developer at DevMentors — contributed to the design and development of the DevMentors website and learning platform, and helped implement course-related features. <br><br>07.2025–present: <br>Data Analyst at PEKAO Bank, working in the Anti-Money Laundering team, focusing on fraud detection and risk assessment."
                    },
                    "hard-skills": {
                        "title": "hard-skills",
                        "description": "<br>Proficient in C#, .NET, ASP.NET, Git, EF Core, and Docker. Basic knowledge of Java, JavaScript, React, and HTML. <br><br>Strong understanding of Azure, PowerShell/terminal, software architecture, and architectural patterns. <br><br>Solid grasp of networking concepts, including decentralized systems such as Tor. <br><br>Fluent in English."
                    },
                    "soft-skills": {
                        "title": "soft-skills",
                        "description": "<br>Strong problem-solving abilities, fast learner, and able to quickly adapt to new project standards. <br><br>Creative, collaborative, and detail-oriented with a proactive approach to teamwork."
                    }
                }
            },
            "personal-info": {
                "title": "personal-info",
                "icon": "icons/info-personal.svg",
                "info": { 
                    "bio": {
                        "title": "bio",
                        "description": "<br>I’m a 20-year-old software developer from Poland. I started coding at 16 and began working on commercial projects in early 2024."
                    },
                    "interests": {
                        "title": "interests",
                        "description": "<br>I’m passionate about motorsports and enjoy driving in my free time. <br><br>I’m also an active person — I regularly go to the gym and train for triathlon. <br><br>In the IT world, I’m deeply interested in cybersecurity. My fascination with privacy and digital security began after learning about Edward Snowden’s story. Since then, I’ve explored topics like decentralization, blockchain, and anonymity networks such as Tor and I2P. I’m particularly intrigued by dVPN systems and security-focused operating systems like Tails. In the future, I want to help non-technical people protect their privacy in an increasingly surveilled digital world."
                    },
                    "education": {
                        "title": "education",
                        "description": "<br>I graduated from the XIII Liceum Ogólnokształcące im. Leopolda Lisa-Kuli (Highschool) in Warsaw, and I’m currently studying Computer Science at PJATK (Polsko-Japońska Akademia Technik Komputerowych - Polish-Japanese Academy of Information Technology) in Warsaw.",
                        "files": {
                            "high-school": "XIII Liceum Ogólnokształcące im. Leopolda Lisa-Kuli.",
                            "university": "PJATK (Polish-Japanese Academy of Information Technology)."
                        }
                    }
                }
            },
            "hobbies-info": {
                "title": "hobbies-info",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "gaming": {
                        "title": "gaming",
                        "description": "<br>Since childhood, I’ve been passionate about gaming. Over the years, I’ve played many popular titles, but I’ve mostly stuck with League of Legends, CS2, Assetto Corsa, Minecraft, and Cuphead. Recently, I’ve been playing less due to limited free time."
                    },
                    "sports": {
                        "title": "sports",
                        "description": "<br>As mentioned in my interests, I’m into sports and fitness. I regularly go to the gym and once planned to compete in a powerlifting event in 2022, but I had to withdraw due to an injury. Currently, I’m training for triathlon and plan to complete a 1/4 Ironman in July 2026."
                    }
                }
            }
        }
    },
    "contacts": {
        "direct": {
            "title": "contacts",
            "sources": {
                "email": "michal.p05@proton.me",
                "phone": "+48 690 363 190"
            }
        },
        "social": {
            "github": {
                "title": "GitHub Profile",
                "url": "https://github.com/",
                "user": "MagicCactus42"
            },
            "linkedin": {
                "title": "LinkedIn Profile",
                "url": "https://www.linkedin.com/in/micha%C5%82-pawlukiewicz-279570305/",
                "user": "Michał Pawlukiewicz"
            }
        }
    },
    "gists": {
        "1": "",
        "2": ""
    },
    "projects": {
        "1": {
            "title": "Susurri",
            "description": "A peer-to-peer chat application based on a Distributed Hash Tables.",
            "img": "/images/projects/black.jpg",
            "tech": ["C#"],
            "url": "https://github.com/MagicCactus42/susurri"
        },
        "2": {
            "title": "TicketFlow",
            "description": "Code written for the DevMentors 'Messaging Pragmatically' course — I made a substantial contribution to the project’s implementation.",
            "img": "/images/projects/blue.jpg",
            "tech": ["C#"],
            "url": "https://github.com/devmentors/Messaging-Pragmatycznie"
        },
        "3": {
            "title": "Calendar",
            "description": "A simple monolithic API originally intended to be integrated with my dad's website — although we never went through with it.",
            "img": "/images/projects/grey.jpg",
            "tech": ["C#"],
            "url": "https://github.com/MagicCactus42/Calendar"
        }
    }
}
